1. Explain the fundamental differences between DDL, DML, and DQL commands in SQL. Provide one example for each type of command.
- SQL commands are categorized into several types based on their purpose. The three key categories are:

  - DDL (Data Definition Language): Defines or modifies database structure such as tables, schemas, or indexes.

    Common commands: CREATE, ALTER, DROP, TRUNCATE.

    Example:

```
CREATE TABLE Students (
     StudentID INT PRIMARY KEY,
     StudentName VARCHAR(100)
     );
```



  - DML (Data Manipulation Language): Manages data within tables. Used to insert, update, or delete data.

    Common commands: INSERT, UPDATE, DELETE.

    Example:


```
INSERT INTO Students (StudentID, StudentName)
VALUES (1, 'John Doe');
```

- DQL (Data Query Language): Used to retrieve data from database objects.

    Primary command: SELECT.

    Example:


```
SELECT * FROM Students;
```
2. What is the purpose of SQL constraints? Name and describe three common types of constraints, providing a simple scenario where each would be useful
- SQL Constraints ensure data integrity, accuracy, and reliability by enforcing rules on the data in a table.
| Constraint      | Description                                    | Example Scenario                                  |
| --------------- | ---------------------------------------------- | ------------------------------------------------- |
| **PRIMARY KEY** | Uniquely identifies each record in a table.    | Every student must have a unique ID.              |
| **FOREIGN KEY** | Establishes a relationship between two tables. | Each order must be linked to a valid customer.    |
| **UNIQUE**      | Ensures all values in a column are distinct.   | No two customers can have the same email address. |


```
CREATE TABLE Customers (
  CustomerID INT PRIMARY KEY,
  CustomerName VARCHAR(100),
  Email VARCHAR(100) UNIQUE
);
```
3. Explain the difference between LIMIT and OFFSET clauses in SQL. How would you use them together to retrieve the third page of results, assuming each page has 10 records?
- LIMIT specifies the maximum number of records to return.

- OFFSET specifies the number of records to skip before starting to return rows.

Together:
To display data in pages (pagination), both are used together.

Example: Retrieve the third page (records 21–30) when each page has 10 records:

```
SELECT * FROM Products
LIMIT 10 OFFSET 20;
```
4. What is a Common Table Expression (CTE) in SQL, and what are its main
benefits? Provide a simple SQL example demonstrating its usage.
- A CTE (Common Table Expression) is a temporary, named result set defined within a SQL query using the WITH clause.
It improves readability and simplifies complex queries.

- Benefits:

  - Makes complex queries easier to understand.

  - Can reference itself (for recursive queries).

  - Used multiple times within the same query.
  
```
  WITH HighValueOrders AS (
  SELECT OrderID, CustomerID, TotalAmount
  FROM Orders
  WHERE TotalAmount > 5000
)
SELECT * FROM HighValueOrders;
```
5. Describe the concept of SQL Normalization and its primary goals. Briefly explain the first three normal forms (1NF, 2NF, 3NF).
- Normalization is the process of organizing database tables to reduce redundancy and improve data integrity.

- Goals:

  - Eliminate data duplication.

  - Ensure data dependencies make sense.

  - Simplify maintenance.

- Normal Forms:

 1. NF (First Normal Form):

  - Each cell contains only atomic (single) values.

  - No repeating groups or arrays.

  - Example: Splitting phone numbers into separate rows.

 2. NF (Second Normal Form):

  - Must satisfy 1NF.

  - All non-key attributes depend on the entire primary key.

  - Example: Remove partial dependencies in composite keys.

 3. NF (Third Normal Form):

  - Must satisfy 2NF.

  - No transitive dependency (non-key attributes should not depend on another non-key attribute).

  - Example: Move derived data like “TotalAmount” into another table or compute on demand.

  6. Create a database named ECommerceDB and perform the following tasks:
  -  Create the following tables with appropriate data types and constraints:
● Categories
○ CategoryID (INT, PRIMARY KEY)
○ CategoryName (VARCHAR(50), NOT NULL, UNIQUE)
● Products
○ ProductID (INT, PRIMARY KEY)
○ ProductName (VARCHAR(100), NOT NULL, UNIQUE)
○ CategoryID (INT, FOREIGN KEY → Categories)
○ Price (DECIMAL(10,2), NOT NULL)
○ StockQuantity (INT)
● Customers
○ CustomerID (INT, PRIMARY KEY)
○ CustomerName (VARCHAR(100), NOT NULL)
○ Email (VARCHAR(100), UNIQUE)
○ JoinDate (DATE)
● Orders
○ OrderID (INT, PRIMARY KEY)
○ CustomerID (INT, FOREIGN KEY → Customers)
○ OrderDate (DATE, NOT NULL)
○ TotalAmount (DECIMAL(10,2))
```
-- Create Database
CREATE DATABASE ECommerceDB;
USE ECommerceDB;

-- 1. Create Categories Table
CREATE TABLE Categories (
  CategoryID INT PRIMARY KEY,
  CategoryName VARCHAR(50) NOT NULL UNIQUE
);

-- 2. Create Products Table
CREATE TABLE Products (
  ProductID INT PRIMARY KEY,
  ProductName VARCHAR(100) NOT NULL UNIQUE,
  CategoryID INT,
  Price DECIMAL(10,2) NOT NULL,
  StockQuantity INT,
  FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID)
);

-- 3. Create Customers Table
CREATE TABLE Customers (
  CustomerID INT PRIMARY KEY,
  CustomerName VARCHAR(100) NOT NULL,
  Email VARCHAR(100) UNIQUE,
  JoinDate DATE
);

-- 4. Create Orders Table
CREATE TABLE Orders (
  OrderID INT PRIMARY KEY,
  CustomerID INT,
  OrderDate DATE NOT NULL,
  TotalAmount DECIMAL(10,2),
  FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);

```
- Insert the following records into each table
● Categories
CategoryID Category Name
1 Electronics
2 Books
3 Home Goods
4 Apparel
● Products
ProductID ProductName CategoryID Price StockQuantity
101 Laptop Pro 1 1200.00 50
102 SQL
Handbook
2 45.50 200
103 Smart Speaker 1 99.99 150
104 Coffee Maker 3 75.00 80
105 Novel : The
Great SQL
2 25.00 120
106 Wireless
Earbuds
1 150.00 100
107 Blender X 3 120.00 60
108 T-Shirt Casual 4 20.00 300
● Customers
CustomerID CustomerName Email Joining Date
1 Alice Wonderland alice@example.com 2023-01-10
2 Bob the Builder bob@example.com 2022-11-25
3 Charlie Chaplin charlie@example.com 2023-03-01
4 Diana Prince diana@example.com 2021-04-26
● Orders
OrderID CustomerID OrderDate TotalAmount
1001 1 2023-04-26 1245.50
1002 2 2023-10-12 99.99
1003 1 2023-07-01 145.00
1004 3 2023-01-14 150.00
1005 2 2023-09-24 120.00
1006 1 2023-06-19 20.00

```
-- Use the database
USE ECommerceDB;

-- 1. Insert records into Categories
INSERT INTO Categories (CategoryID, CategoryName)
VALUES
(1, 'Electronics'),
(2, 'Books'),
(3, 'Home Goods'),
(4, 'Apparel');

-- 2. Insert records into Products
INSERT INTO Products (ProductID, ProductName, CategoryID, Price, StockQuantity)
VALUES
(101, 'Laptop Pro', 1, 1200.00, 50),
(102, 'SQL Handbook', 2, 45.80, 200),
(103, 'Smart Speaker', 1, 99.99, 150),
(104, 'Coffee Maker', 3, 75.00, 80),
(105, 'Novel: The Great Soul', 2, 28.00, 120),
(106, 'Wireless Earbuds', 1, 150.00, 100),
(107, 'Blender X', 3, 120.00, 60),
(108, 'T-Shirt Casual', 4, 20.00, 300);

-- 3. Insert records into Customers
INSERT INTO Customers (CustomerID, CustomerName, Email, JoinDate)
VALUES
(1, 'Alice Wonderland', 'alice@example.com', '2023-01-10'),
(2, 'Bob the Builder', 'bob@example.com', '2023-11-15'),
(3, 'Charlie Chaplin', 'charlie@example.com', '2023-03-21'),
(4, 'Diana Prince', 'diana@example.com', '2021-04-26');

-- 4. Insert records into Orders
INSERT INTO Orders (OrderID, CustomerID, OrderDate, TotalAmount)
VALUES
(1001, 1, '2023-04-28', 1245.50),
(1002, 2, '2023-11-15', 95.00),
(1003, 3, '2023-07-14', 145.00),
(1004, 4, '2023-03-21', 560.00),
(1005, 2, '2023-06-19', 28.00);

```
7. Generate a report showing CustomerName, Email, and the TotalNumberofOrders for each customer. Include customers who have not placed any orders, in which case their TotalNumberofOrders should be 0. Order the results by CustomerName.

```
SELECT
    c.CustomerName,
    c.Email,
    COUNT(o.OrderID) AS TotalNumberOfOrders
FROM
    Customers c
LEFT JOIN
    Orders o ON c.CustomerID = o.CustomerID
GROUP BY
    c.CustomerID, c.CustomerName, c.Email
ORDER BY
    c.CustomerName;
```
8. Retrieve Product Information with Category: Write a SQL query to display the ProductName, Price, StockQuantity, and CategoryName for all products. Order the results by CategoryName and then ProductName alphabetically.
```
SELECT
    p.ProductName,
    p.Price,
    p.StockQuantity,
    c.CategoryName
FROM
    Products p
INNER JOIN
    Categories c ON p.CategoryID = c.CategoryID
ORDER BY
    c.CategoryName, p.ProductName;
```
9. Write a SQL query that uses a Common Table Expression (CTE) and a Window Function (specifically ROW_NUMBER() or RANK()) to display the CategoryName, ProductName, and Price for the top 2 most expensive products in each CategoryName.
```
WITH RankedProducts AS (
    SELECT
        c.CategoryName,
        p.ProductName,
        p.Price,
        ROW_NUMBER() OVER (PARTITION BY c.CategoryName ORDER BY p.Price DESC) AS RankNo
    FROM
        Products p
    INNER JOIN
        Categories c ON p.CategoryID = c.CategoryID
)
SELECT
    CategoryName,
    ProductName,
    Price
FROM
    RankedProducts
WHERE
    RankNo <= 2
ORDER BY
    CategoryName, Price DESC;
```
10. You are hired as a data analyst by Sakila Video Rentals, a global movie rental company. The management team is looking to improve decision-making by analyzing existing customer, rental, and inventory data. Using the Sakila database, answer the following business questions to support key strategic initiatives. Tasks & Questions:
- Identify the top 5 customers based on the total amount they’ve spent. Include customer
name, email, and total amount spent.
- Which 3 movie categories have the highest rental counts? Display the category name
and number of times movies from that category were rented.
- Calculate how many films are available at each store and how many of those have
never been rented.
- Show the total revenue per month for the year 2023 to analyze business seasonality.
- Identify customers who have rented more than 10 times in the last 6 months.

- Top 5 Customers by Total Amount Spent
```
SELECT
    c.first_name AS CustomerFirstName,
    c.last_name AS CustomerLastName,
    c.email,
    SUM(p.amount) AS TotalSpent
FROM
    customer c
JOIN
    payment p ON c.customer_id = p.customer_id
GROUP BY
    c.customer_id, c.first_name, c.last_name, c.email
ORDER BY
    TotalSpent DESC
LIMIT 5;
```
- Top 3 Movie Categories with Highest Rental Counts
```
SELECT
    cat.name AS CategoryName,
    COUNT(r.rental_id) AS RentalCount
FROM
    category cat
JOIN
    film_category fc ON cat.category_id = fc.category_id
JOIN
    inventory i ON fc.film_id = i.film_id
JOIN
    rental r ON i.inventory_id = r.inventory_id
GROUP BY
    cat.name
ORDER BY
    RentalCount DESC
LIMIT 3;
```
- Films Available at Each Store and Never Rented
```
SELECT
    s.store_id,
    COUNT(i.inventory_id) AS TotalFilms,
    SUM(CASE WHEN r.rental_id IS NULL THEN 1 ELSE 0 END) AS NeverRentedFilms
FROM
    store s
JOIN
    inventory i ON s.store_id = i.store_id
LEFT JOIN
    rental r ON i.inventory_id = r.inventory_id
GROUP BY
    s.store_id;
```
-  Total Revenue per Month for the Year 2023
```
SELECT
    DATE_FORMAT(payment_date, '%Y-%m') AS Month,
    SUM(amount) AS TotalRevenue
FROM
    payment
WHERE
    YEAR(payment_date) = 2023
GROUP BY
    DATE_FORMAT(payment_date, '%Y-%m')
ORDER BY
    Month;
```
-  Customers Who Rented More Than 10 Times in the Last 6 Months
```
SELECT
    c.customer_id,
    c.first_name,
    c.last_name,
    COUNT(r.rental_id) AS RentalCount
FROM
    customer c
JOIN
    rental r ON c.customer_id = r.customer_id
WHERE
    r.rental_date >= DATE_SUB(CURDATE(), INTERVAL 6 MONTH)
GROUP BY
    c.customer_id, c.first_name, c.last_name
HAVING
    RentalCount > 10
ORDER BY
    RentalCount DESC;
```